btgrand/app/controllers/customers_controller.rb

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)

  def search
    @customers = Customer.search(params[:search])
---
SELECT * FROM `customers` WHERE (name LIKE '%123%' OR sname LIKE '%123%' OR nickname LIKE '%123%' OR address_home LIKE '%123%' OR address_work LIKE '%123%') ORDER BY name

  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      format.html { redirect_to(:controller => 'customers') }
      if @customer.save
---
INSERT INTO `customers` (`name`, `company`, `sname`, `vehicle`, `updated_at`, `nickname`, `remark`, `last_price`, `phone_work`, `phone`, `picture`, `identity_number`, `address_home`, `address_work`, `created_at`) VALUES('รักไท', '', '', '', '2010-05-11 11:09:33', '', '', 350.0, '', '0896174738', NULL, '', '', '', '2010-05-11 11:09:33')

  def update
    @customer = Customer.find(params[:id])

    respond_to do |format|
      format.html { redirect_to(:controller => 'customers') }
      if @customer.update_attributes(params[:customer])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
UPDATE `customers` SET `phone` = '55', `remark` = '', `vehicle` = '', `address_home` = '', `last_price` = 350.0, `address_work` = '', `phone_work` = '', `updated_at` = '2010-05-11 17:01:00' WHERE `id` = 1

  def destroy
    @customer = Customer.find(params[:id])

    respond_to do |format|
      format.html { redirect_to(:controller => 'customers') }
      if @customer.destroy
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 0)
DELETE FROM `customers` WHERE `id` = 6