btgrand/app/controllers/layout_controller.rb

SELECT * FROM `transacs` WHERE (checkout < '2010-05-05 14:49:18' AND isactive = 1)
---
	def index
		@title = "BT Grand Condotel"
    @date = get_date(params[:date])

    @detail = {}

    needcheckout = Transac.NeedCheckOut(Time.now)
    @needcheckout = []
    needcheckout.each do |room|

SELECT * FROM `transacs` WHERE (isactive = 1) ORDER BY room_no
---
  def new
    roomno = params[:room_no].to_i
    if all_room.index(roomno).nil?
        redirect_to(:action => "index")
    end
    @title = "เช็คอิน"
    @transac = Transac.new

    ##########################
    list = []
#    blockedrooms = Blockedroom.find(:all)
#    @list = []
#    blockedrooms.each do |room|
#      @list.push(room.list)
#    end

    Transac.AllUsedRoom.each do |room|

INSERT INTO `paylists` (`room_price_date`, `ispay`, `updated_at`, `price`, `transac_id`, `iscancel`, `user_id`, `detail`, `ptype`, `created_at`) VALUES('2010-05-05 06:57:56', 0, '2010-05-05 06:57:56', 700.0, 1, NULL, NULL, 'ค่าห้อง 05/05/2010', 1, '2010-05-05 06:57:56')
INSERT INTO `transacs` (`customer_name`, `deposit`, `updated_at`, `price`, `remark`, `room_no`, `isactive`, `checkin`, `customer_id`, `customer_phone`, `iscancel`, `user_id`, `room_hist_id`, `checkout`, `balance`, `created_at`) VALUES('รักไท ชูมีชัย', 0.0, '2010-05-05 06:57:56', 700.0, '', 509, 1, '2010-05-05 06:57:56', NULL, '', NULL, NULL, NULL, '2010-05-06 13:00:00', 0.0, '2010-05-05 06:57:56')
---
  def checkin
    @title = "เช็คอิน"
    @transac = Transac.new(params[:transac])
    timenow = Time.now
    @transac.checkin = timenow
    checkout = timenow.advance(:days => @transac.days.to_i)
    @transac.checkout = DateTime.new(checkout.year, checkout.month, checkout.day, 13, 0)
    @transac.isactive = 1
    bal = @transac.pay.to_i

    @transac.days.to_i.times do |i|
      @transac.paylist.build({:detail => "ค่าห้อง "+(@transac.checkin.advance(:days => i)).strftime('%d/%m/%Y'),
                              :price => @transac.price,
                              :ispay => (bal >= @transac.price),
                              :room_price_date => Date.parse(@transac.checkin.advance(:days => i).strftime('%Y/%m/%d')),
                              :ptype => 1})
      bal -= @transac.price unless bal < @transac.price
    end

    @transac.balance = bal


    respond_to do |format|
      if @transac.save

SELECT * FROM `transacs` WHERE (`transacs`.`id` = 5)
UPDATE `transacs` SET `checkout` = '2010-05-08 13:00:00', `updated_at` = '2010-05-09 07:05:03' WHERE `id` = 5
---
  def doexpand
    Transac.transaction do
      @transac = Transac.find(params[:transacid].to_i)
      if !@transac.nil?
        days = params[:days].to_i
        if days > 0
          ispay = @transac.balance >= @transac.price
          checkout = @transac.checkout.advance(:days => days)
          @transac.paylist.build({:detail => "ค่าห้อง "+checkout.strftime('%d/%m/%Y'),
                                  :price => @transac.price*days,
                                  :room_price_date => Date.parse(checkout.strftime('%Y/%m/%d')),
                                  :ispay => ispay,
                                  :ptype => 1})
          @transac.update_attribute(:checkout, checkout)

SELECT * FROM `paylists` WHERE (`paylists`.transac_id = 4) ORDER BY created_at
UPDATE `paylists` SET `ispay` = 1, `updated_at` = '2010-05-09 05:58:19' WHERE `id` = 7
SELECT * FROM `transacs` WHERE (`transacs`.`id` = 4)
UPDATE `transacs` SET `balance` = 300.0, `updated_at` = '2010-05-09 07:04:51' WHERE `id` = 5
---
  def dopay
    Paylist.transaction do
      if !params[:payment].nil?
        params[:payment].each do |pay|
          if !pay[1].nil?
            pl = Paylist.find(pay[0])
            pl.update_attribute(:ispay, true)
          end
        end
      end
    end

    #additional pay
    if !params[:deposit].nil?
      Transac.transaction do
        Paylist.transaction do
          balance = params[:deposit].to_i
          @transac = Transac.find(params[:transacid].to_i)
          if balance > 0

            balance += @transac.balance
            for pay in @transac.paylist do
              if !pay.ispay? && balance >= pay.price
                balance -= pay.price
                pay.update_attribute(:ispay, true)
              end
            end

            @transac.update_attribute(:balance, balance)

SELECT * FROM `transacs` WHERE (`transacs`.`id` = 1)
UPDATE `transacs` SET `remark` = 'ทดสอบ', `updated_at` = '2010-05-09 06:23:43' WHERE `id` = 1
---
  def changeremark
    @transac = Transac.find(params[:transacid])
    @transac.update_attribute(:remark, params[:remark])

SELECT * FROM `transacs` WHERE (`transacs`.`id` = 7)
DELETE FROM `paylists` WHERE (`id` IN (17))
UPDATE `paylists` SET `ispay` = 1, `updated_at` = '2010-05-09 09:41:30' WHERE `id` = 16
UPDATE `transacs` SET `isactive` = 0, `updated_at` = '2010-05-09 09:42:02' WHERE `id` = 7
---
  def checkout
    @transac = Transac.find(params[:transacid])
    #ให้เช็คเรื่องจ่ายเงินว่าคีย์เข้ามาเท่าไหร่ พอก้บที่ค้างไว้หรือไม่ ถ้าไม่พอไม่ยอมให้เช็คเอาต์
    unpaysum = 0
    payedsum = 0
    today = Date.today
    for pay in @transac.paylist do
      if pay.ispay?
        payedsum += pay.price
      end
      if pay.ptype == 1 and pay.room_price_date <= today
        unpaysum += pay.price
      elsif pay.ptype!=1
        unpaysum += pay.price
      end
    end

    bal = (payedsum - unpaysum) + @transac.deposit + @transac.balance

    if bal<0 && (params[:pay_checkout].nil? || (params[:pay_checkout].to_i + bal < 0))
      @error = "กรุณาใส่จำนวนเงินให้ตรงกับจำนวนต้องชำระเพิ่ม"
    else
      begin
        Transac.transaction do
          Paylist.transaction do
            for pay in @transac.paylist do
              if pay.ptype == 1 and pay.room_price_date > today
                Paylist.delete(pay.id)
              elsif !pay.ispay?
                pay.update_attribute(:ispay,true)
              end
            end
            if @error.nil? &&  @transac.update_attribute(:isactive, false)

SELECT * FROM `transacs` WHERE (room_no = 'on' AND isactive = 1)
UPDATE `transacs` SET `room_hist_id` = 11, `room_no` = 101, `updated_at` = '2010-05-09 10:30:15' WHERE `id` = 8
---
  def move
    if !params[:changeroom].nil?
      Transac.transaction do
        old = Transac.find(params[:transacid].to_i)
        new = old.clone
        new.isactive = false
        new.save_with_validation(false)
        old.room_hist_id = new.id
        old.room_no = params[:chooseroom]
        old.save_with_validation(false)

SELECT * FROM `transacs` WHERE (`transacs`.`id` = 8)
UPDATE `transacs` SET `remark` = 'ลูกค้าไม่มา', `isactive` = 0, `updated_at` = '2010-05-09 12:31:41', `iscancel` = 1 WHERE `id` = 8
---
  def cancel
    @transac = Transac.find(params[:transacid])
    if params[:remark].empty?
      @error = "กรุณาป้อนเหตุผลที่ยกเลิก"
    else
      @transac.remark = params[:remark]
      @transac.isactive = false
      @transac.iscancel = true
      if !@transac.save_with_validation(false)